#Клавиатура для выбора стран
country_keyboard = ReplyKeyboardMarkup(resize_keyboard=True)
country_keyboard.add(
    KeyboardButton('Россия'),
    KeyboardButton('Турция'),
    KeyboardButton('Израиль'),
    KeyboardButton('Армения'),
    KeyboardButton('Сербия'),
    KeyboardButton('Беларусь'),
    KeyboardButton('Грузия'),
    KeyboardButton('Казахстан'),
    KeyboardButton('Кыргызстан'),
    KeyboardButton('Азербайджан'),
    KeyboardButton('ОАЭ'),
    KeyboardButton('Черногория'),
    KeyboardButton('Болгария'),
    KeyboardButton('Греция'),
    KeyboardButton('Кипр'),
)

#Словарь с городами для каждой страны
cities_by_country = {
    'Россия': ['Москва', 'Санкт-Петербург', 'Казань', 'Сочи', 'Самара', 'Калининград', 'Краснодар', 'Екатеринбург',\
               'Новосибирск', 'Ростов-на-Дону', 'Уфа', 'Пермь', 'Красноярск', 'Грозный', 'Махачкала',\
               'Минеральные воды', 'Владикавказ', 'Иркутск', 'Волгоград', 'Нижний Новгород', 'Омск', 'Сургут', \
               'Челябинск', 'Петрозаводск', 'Оренбург', 'Кемерово', 'Братск', 'Астрахань', 'Саратов', 'Тюмень'],
    'Турция': ['Анталья', 'Стамбул', 'Аланья', 'Измир', 'Анкара', 'Даламан', 'Ризе', 'Адана', 'Мерсин', 'Трабзон',\
               'Кайсери', 'Самсун'],
    'Сербия': ['Белград'],
    'Израиль': ['Тель-Авив', 'Иерусалим', 'Беэр-Шева', 'Хайфа'],
    'Армения': ['Ереван', 'Гюмри'],
    'Грузия': ['Тбилиси', 'Батуми'],
    'Казахстан': ['Алматы', 'Астана', 'Шымкент', 'Атырау', 'Актау'],
    'Беларусь': ['Минск'],
    'ОАЭ': ['Дубай', 'Шарджа', 'Абу-Даби'],
    'Кыргызстан': ['Бишкек', 'Ош'],
    'Черногория': ['Тиват', 'Будва', 'Котор', 'Подгорица', 'Петровац', 'Херцег-Нови', 'Цетине', 'Бар'],
    'Болгария' : ['София', 'Варна', 'Бургас', 'Несебыр', 'Солнечный Берег'],
    'Греция' : ['Афины', 'Салоники'],
    'Кипр' : ['Лимассол', 'Ларнака', 'Айя-Напа', 'Пафос'],
    'Азербайджан' : ['Баку', 'Гянджа', 'Нахичевань', 'Ленкорань', 'Габала'],
}

#Функция для создания клавиатуры с городами выбранной страны
def city_keyboard(country):
    keyboard = ReplyKeyboardMarkup(resize_keyboard=True)
    if country in cities_by_country:
        for city in cities_by_country[country]:
            keyboard.add(city)
    return keyboard
